#### Load .db

In [9]:
from pathlib import Path
import os, sqlite3, pandas as pd
# find repo root (folder with .git)
p = Path(os.getcwd())
while p != p.parent and not (p/".git").exists():
    p = p.parent
ROOT = p
DB = ROOT / "events.db"

print("Using DB:", DB.resolve())

# open read-only (prevents accidentally creating an empty DB)
con = sqlite3.connect(f"file:{DB.resolve()}?mode=ro", uri=True)

Using DB: /Users/student/Desktop/NWU_MLDS/400/final/ticketmaster-data-collection/events.db

In [2]:
# tables
tables = pd.read_sql("""
    SELECT name, type
    FROM sqlite_master
    WHERE type IN ('table','view')
    ORDER BY type, name;
""", con)
tables

                  name   type
0              artists  table
1  event_price_history  table
2               events  table
3               venues  table

In [3]:
# row counts
row_counts = []
for t in tables[tables.type=="table"]["name"]:
    n = pd.read_sql(f"SELECT COUNT(*) AS n FROM {t};", con).iloc[0,0]
    row_counts.append({"table": t, "rows": n})
pd.DataFrame(row_counts)

                 table   rows
0              artists   2219
1  event_price_history  10157
2               events   4410
3               venues   1783

#### Table Overview

In [4]:
pd.read_sql("PRAGMA table_info(events);", con)

    cid          name       type  notnull dflt_value  pk
0     0      event_id       TEXT        0       None   1
1     1          name       TEXT        0       None   0
2     2           url       TEXT        0       None   0
3     3          type       TEXT        0       None   0
4     4        locale       TEXT        0       None   0
5     5        status       TEXT        0       None   0
6     6      datetime  TIMESTAMP        0       None   0
7     7   onsale_date  TIMESTAMP        0       None   0
8     8  offsale_date  TIMESTAMP        0       None   0
9     9       segment       TEXT        0       None   0
10   10         genre       TEXT        0       None   0
11   11      subgenre       TEXT        0       None   0
12   12        family    BOOLEAN        0       None   0
13   13     artist_id       TEXT        0       None   0
14   14      venue_id       TEXT        0       None   0

In [18]:
pd.read_sql("PRAGMA table_info(artists);", con)

   cid         name  type  notnull dflt_value  pk
0    0    artist_id  TEXT        0       None   1
1    1  artist_name  TEXT        0       None   0

In [19]:
pd.read_sql("PRAGMA table_info(event_price_history);", con)

   cid           name       type  notnull dflt_value  pk
0    0       event_id       TEXT        1       None   1
1    1  snapshot_date  TIMESTAMP        1       None   2
2    2      min_price       REAL        0       None   0
3    3      max_price       REAL        0       None   0
4    4       currency       TEXT        0       None   0

In [20]:
pd.read_sql("PRAGMA table_info(venues);", con)

   cid        name  type  notnull dflt_value  pk
0    0    venue_id  TEXT        0       None   1
1    1  venue_name  TEXT        0       None   0
2    2        city  TEXT        0       None   0
3    3       state  TEXT        0       None   0
4    4     country  TEXT        0       None   0
5    5         lat  REAL        0       None   0
6    6         lon  REAL        0       None   0